[Increase in # of Hosts Logged into]
alert.expires = 90m
dispatch.ttl = 18p
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */40 * * * *
description = Find users who log into more hosts than they typically do.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
enableSched = 1
quantity = 0
relation = greater than
search = index=* source="*WinEventLog:Security" (4624 OR 4647 OR 4648 OR 551 OR 552 OR 540 OR 528 OR 4768 OR 4769 OR 4770 OR 4771 OR 4768 OR 4774 OR 4776 OR 4778 OR 4779 OR 672 OR 673 OR 674 OR 675 OR 678 OR 680 OR 682 OR 683) | bucket _time span=1d | stats dc(host) as count by user _time | stats count as num_data_samples max(eval(if(_time >= relative_time(maxtime, "-1d@d"), 'count',null))) as count avg(eval(if(_time<relative_time(maxtime,"-1d@d"),'count',null))) as avg stdev(eval(if(_time<relative_time(maxtime,"-1d@d"),'count',null))) as stdev by user | eval lowerBound=(avg-stdev*2), upperBound=(avg+stdev*2) | where 'count' > upperBound AND num_data_samples >=7

[Potential Data Compressed for Exfiltration]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Alerts when there is a large amount of data written to a compressed file, which could be a sign of data being prepared for exfiltration.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=11 | where TargetFilename LIKE "%.zip" OR TargetFilename LIKE "%.rar" OR TargetFilename LIKE "%.tar" OR TargetFilename LIKE "%.gz" | stats sum(Write_Bytes) as total_bytes by User,TargetFilename | where total_bytes > 10000000

[Failed Logins Followed by Successful Login]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Alerts when there are multiple failed logins for a user, followed by a successful login, which could be a sign of a successful brute force attack.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="WinEventLog:security" (EventCode=4625 OR EventCode=4624) | stats count by EventCode,Account_Name | where count > 3


[Non-Interactive PowerShell Session]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Alerts when a non-interactive PowerShell session is started, which could be a sign of a script running.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 | where CommandLine="-NonI -W Hidden -NoP -Exec Bypass"


[Potential Process Injection]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Alerts when a process exhibits behavior that could be indicative of Process Injection.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=8 | where CallTrace LIKE "%UNKNOWN%" OR CallTrace LIKE "%wow64%" OR CallTrace LIKE "%unknown%"

[Detected Named Pipe Creation]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 2
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Alerts when a named pipe is created, which could be a sign of inter-process communication commonly used by malware.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=17

[Potential Pass-the-Hash Attack]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Alerts when a process accesses the SAM or Vault DLLs, which could be a sign of a Pass-the-Hash attack.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=10 | where CallTrace LIKE "%samlib.dll%" OR CallTrace LIKE "%vaultcli.dll%"

[Suspicious Process Access]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Alerts when a process accesses another process in a suspicious way, which could be a sign of process injection or credential dumping.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=10 | where CallTrace LIKE "%UNKNOWN%" OR CallTrace LIKE "%wow64%" OR CallTrace LIKE "%unknown%"

[DLL Load Failed]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Alerts when a DLL load fails, which could be a sign of DLL sideloading.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="WinEventLog:Application" EventCode=1000  Exception_code=0xc0000135

[Detect Use of Tools like PsExec]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Detects the use of tools like PsExec, which are often used in lateral movement.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 | where Image LIKE "%\services.exe" AND ParentImage LIKE "%\PsExec.exe"

[Suspicious PowerShell Command Line]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Alerts when a suspicious PowerShell command line is detected, which could be a sign of a script running.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 | where CommandLine LIKE "%EncodedCommand%" OR CommandLine LIKE "%ep bypass%" OR CommandLine LIKE "%-NoP%"

[Successful Login After Multiple Failures]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Detects successful login after multiple failures, which might indicate a successful brute force attack.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="WinEventLog:Security" (EventCode=4625 OR EventCode=4624)

[Malware Often Changes File Creation Time]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Detects file creation time changes, often associated with malware attempting to hide itself.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=2 | where PreviousCreationTime!=file_create_time

[New Kernel Filter Driver]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Detects a new kernel filter driver, which could indicate potential rootkit behavior.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="WinEventLog:Security" EventCode=6

[Account Locked Out]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Detects when an account is locked out, which could indicate a brute force attempt.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="WinEventLog:Security" EventCode=4740

[Change in User Account Control]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Detects changes in User Account Control (UAC), which could indicate privilege escalation or other suspicious activity.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="WinEventLog:Security" EventCode=4675

[Change in System Time]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Detects changes in system time, which could indicate evasion tactics by malware or other malicious activities.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="WinEventLog:Security" EventCode=520

[Detected a New Service Installation]
action.webhook.enable_allowlist = 0
alert.expires = 90m
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Detects a new service installation, which could be related to a persistence mechanism.
disabled = 1
dispatch.earliest_time = 1686762000
dispatch.latest_time = 1686805200
dispatch.ttl = 18p
enableSched = 1
quantity = 0
relation = greater than
search = index=main source="WinEventLog:Security" EventCode=601
